; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain mailrun)
    (:types
        hamlet scroll satchel courier - object
    )
    (:predicates
        (posted-at ?b - courier ?x - hamlet)
        (resting ?i - scroll ?x - hamlet)
        (road ?x - hamlet ?y - hamlet)
        (idle ?a - satchel)
        (held-in ?i - scroll ?a - satchel)
        (stowed-in ?i - scroll ?b - courier)
        (attached ?a - satchel ?b - courier)
    )

    (:functions
        (pouch_limit ?b - courier)
        (current_pouch ?b - courier)
        (mass ?i - scroll)
        (toll)
    )

    (:action ride
        :parameters (?b - courier ?x - hamlet ?y - hamlet)
        :precondition (and (posted-at ?b ?x)
            (road ?x ?y))
        :effect (and (posted-at ?b ?y)
            (not (posted-at ?b ?x))
            (increase (toll) 3)
        )
    )

    (:action grab
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (resting ?i ?x) (posted-at ?b ?x) (idle ?a) (attached ?a ?b)
            (<= (+ (current_pouch ?b) (mass ?i)) (pouch_limit ?b)))
        :effect (and (held-in ?i ?a)
            (not (resting ?i ?x))
            (not (idle ?a))
            (increase (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action place
        :parameters (?i - scroll ?x - hamlet ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (posted-at ?b ?x)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (resting ?i ?x)
            (not (held-in ?i ?a))
            (decrease (current_pouch ?b) (mass ?i))
            (increase (toll) 2)
        )
    )

    (:action to-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (held-in ?i ?a)
            (attached ?a ?b))
        :effect (and (idle ?a)
            (not (held-in ?i ?a))
            (stowed-in ?i ?b)
            (increase (toll) 1)
        )
    )

    (:action from-pouch
        :parameters (?i - scroll ?a - satchel ?b - courier)
        :precondition (and (stowed-in ?i ?b)
            (attached ?a ?b)
            (idle ?a))
        :effect (and (not (idle ?a))
            (held-in ?i ?a)
            (not (stowed-in ?i ?b))
            (increase (toll) 1)
        )
    )
)

; problem
(define (problem delivery-x-1)
   (:domain mailrun)
   (:objects hamleta hamletb hamletc - hamlet
             scroll4 scroll3 scroll2 scroll1 - scroll
             courier1 courier2 - courier
             leftstrap1 rightstrap1 leftstrap2 rightstrap2 - satchel)
   (:init (= (mass scroll4) 1)
          (= (mass scroll3) 1)
          (= (mass scroll2) 1)
          (= (mass scroll1) 1)
          (posted-at courier1 hamleta)
          (posted-at courier2 hamleta)
          (idle leftstrap1)
          (idle rightstrap1)
          (idle leftstrap2)
          (idle rightstrap2)
          (attached leftstrap1 courier1)
          (attached rightstrap1 courier1)
          (attached leftstrap2 courier2)
          (attached rightstrap2 courier2)
          (resting scroll4 hamleta)
          (resting scroll3 hamleta)
          (resting scroll2 hamleta)
          (resting scroll1 hamleta)

          (road hamleta hamletb)
          (road hamletb hamleta)
          (road hamleta hamletc)
          (road hamletc hamleta)

          (= (current_pouch courier1) 0)
          (= (pouch_limit courier1) 4)
          (= (current_pouch courier2) 0)
          (= (pouch_limit courier2) 4)
          (= (toll) 0))

   (:goal (and (resting scroll4 hamletb)
               (resting scroll3 hamletb)
               (resting scroll2 hamletc)
               (resting scroll1 hamletc)))

   (:metric minimize (toll))
)

; plan
1. (grab scroll1 hamleta rightstrap1 courier1)
   deleted: (resting scroll1 hamleta) (idle rightstrap1)
   added: (held-in scroll1 rightstrap1)
   changed: (current_pouch courier1) from 0 to 1, (toll) from 0 to 2
   goals met: 0 of 4
2. (ride courier1 hamleta hamletc)
   deleted: (posted-at courier1 hamleta)
   added: (posted-at courier1 hamletc)
   changed: (toll) from 2 to 5
   goals met: 0 of 4
3. (grab scroll4 hamleta leftstrap2 courier2)
   deleted: (resting scroll4 hamleta) (idle leftstrap2)
   added: (held-in scroll4 leftstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 5 to 7
   goals met: 0 of 4
4. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 7 to 10
   goals met: 0 of 4
5. (place scroll4 hamletb leftstrap2 courier2)
   deleted: (held-in scroll4 leftstrap2)
   added: (idle leftstrap2) (resting scroll4 hamletb)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 10 to 12
   goals met: 1 of 4
6. (place scroll1 hamletc rightstrap1 courier1)
   deleted: (held-in scroll1 rightstrap1)
   added: (idle rightstrap1) (resting scroll1 hamletc)
   changed: (current_pouch courier1) from 1 to 0, (toll) from 12 to 14
   goals met: 2 of 4
7. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 14 to 17
   goals met: 2 of 4
8. (grab scroll2 hamleta rightstrap2 courier2)
   deleted: (resting scroll2 hamleta) (idle rightstrap2)
   added: (held-in scroll2 rightstrap2)
   changed: (current_pouch courier2) from 0 to 1, (toll) from 17 to 19
   goals met: 2 of 4
9. (grab scroll3 hamleta leftstrap2 courier2)
   deleted: (resting scroll3 hamleta) (idle leftstrap2)
   added: (held-in scroll3 leftstrap2)
   changed: (current_pouch courier2) from 1 to 2, (toll) from 19 to 21
   goals met: 2 of 4
10. (ride courier2 hamleta hamletb)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletb)
   changed: (toll) from 21 to 24
   goals met: 2 of 4
11. (place scroll3 hamletb leftstrap2 courier2)
   deleted: (held-in scroll3 leftstrap2)
   added: (idle leftstrap2) (resting scroll3 hamletb)
   changed: (current_pouch courier2) from 2 to 1, (toll) from 24 to 26
   goals met: 3 of 4
12. (ride courier2 hamletb hamleta)
   deleted: (posted-at courier2 hamletb)
   added: (posted-at courier2 hamleta)
   changed: (toll) from 26 to 29
   goals met: 3 of 4
13. (ride courier2 hamleta hamletc)
   deleted: (posted-at courier2 hamleta)
   added: (posted-at courier2 hamletc)
   changed: (toll) from 29 to 32
   goals met: 3 of 4
14. (place scroll2 hamletc rightstrap2 courier2)
   deleted: (held-in scroll2 rightstrap2)
   added: (idle rightstrap2) (resting scroll2 hamletc)
   changed: (current_pouch courier2) from 1 to 0, (toll) from 32 to 34
   goals met: 4 of 4
